snlkuharlocal/src/DataProcessors/ОбработатьПисьмаНаОтправку/ОбработатьПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработатьПисьмаНаОтправку</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись электронной почты</description>
    </items>
    <items>
      <name>УчетнаяЗаписьОбменаСТК</name>
      <description>Учетная запись обмена с ТК</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMAPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортPOP3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортIMAP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяSMTPАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаПисемПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжиданияСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВид</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВУ</name>
    <comment>Номер водительского удостоверения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение (Периодический реквизит)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительныйПадеж</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АссистентМенеджера</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПодразделенияУСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомерСотрудникаЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускВездеход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПродаж</name>
    <comment>Работник склада забронирован данным подразделением ЦО</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобренСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ОбработатьПисьмаНаОтправку/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	// Кухарь А.Ю.  05.06.2023 начало
	МассивДокументов=новый Массив;
	если ТипЗнч(ТаблицаПараметров) =Тип("ТаблицаЗначений") тогда
		для каждого СтрТЗ из ТаблицаПараметров цикл
			Если СтрТЗ.Имя="ОтборПоДокументу" тогда
				МассивДокументов.Добавить(СтрТЗ.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю.  05.06.2023 конец
	
	
    //Тимофеев Ю.А. начало 03.08.2023
	
	//Запрос=новый запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//|	ПисьмаНаОтправку.Основание КАК Основание,
	//|	ПисьмаНаОтправку.СписокПолучателей КАК СписокПолучателей,
	//|	ПисьмаНаОтправку.ТекстПисьма КАК ТекстПисьма,
	//|	ПисьмаНаОтправку.ТемаПисьма КАК ТемаПисьма,
	//|	ПисьмаНаОтправку.ДатаСозданияПисьма КАК ДатаСозданияПисьма,
	//|	ПисьмаНаОтправку.ИмяФайлаВложения КАК ИмяФайлаВложения,
	//|	ПисьмаНаОтправку.Вложение КАК Вложение,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ПисьмаНаОтправку.УчетнаяЗаписьОтправителя) = ТИП(Справочник.УчетныеЗаписиЭлектроннойПочты)
	//|			ТОГДА ПисьмаНаОтправку.УчетнаяЗаписьОтправителя.АдресЭлектроннойПочты
	//|		ИНАЧЕ ЕСТЬNULL(ПисьмаНаОтправку.УчетнаяЗаписьОтправителя, """")
	//|	КОНЕЦ КАК АдресОтправителя
	//|ИЗ
	//|	РегистрСведений.ПисьмаНаОтправку КАК ПисьмаНаОтправку
	//|ГДЕ
	//|	ПисьмаНаОтправку.ДатаСозданияПисьма >= &Дата1
	//|	И (ВЫРАЗИТЬ(ПисьмаНаОтправку.СписокПолучателей КАК СТРОКА(10))) <> """"
	//|	И (ВЫРАЗИТЬ(ПисьмаНаОтправку.ТекстПисьма КАК СТРОКА(10))) <> """"
	//|	И ПисьмаНаОтправку.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)";  
	//
	
	
	
	//СписокПолучателейКопии
	
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПисьмаНаОтправку.Основание КАК Основание,
	             |	ПисьмаНаОтправку.СписокПолучателей КАК СписокПолучателей,
	             |	ПисьмаНаОтправку.ТекстПисьма КАК ТекстПисьма,
	             |	ПисьмаНаОтправку.ТемаПисьма КАК ТемаПисьма,
	             |	ПисьмаНаОтправку.ДатаСозданияПисьма КАК ДатаСозданияПисьма,
	             |	ПисьмаНаОтправку.ИмяФайлаВложения КАК ИмяФайлаВложения,
	             |	ПисьмаНаОтправку.Вложение КАК Вложение,
	             |	ВЫБОР
	             |		КОГДА ТИПЗНАЧЕНИЯ(ПисьмаНаОтправку.УчетнаяЗаписьОтправителя) = ТИП(Справочник.УчетныеЗаписиЭлектроннойПочты)
	             |			ТОГДА ПисьмаНаОтправку.УчетнаяЗаписьОтправителя.АдресЭлектроннойПочты
	             |		ИНАЧЕ ЕСТЬNULL(ПисьмаНаОтправку.УчетнаяЗаписьОтправителя, """")
	             |	КОНЕЦ КАК АдресОтправителя,
	             |	ПисьмаНаОтправку.СписокПолучателейКопии КАК СписокПолучателейКопии
	             |ИЗ
	             |	РегистрСведений.ПисьмаНаОтправку КАК ПисьмаНаОтправку
	             |ГДЕ
	             |	ПисьмаНаОтправку.ДатаСозданияПисьма >= &Дата1
	             |	И (ВЫРАЗИТЬ(ПисьмаНаОтправку.СписокПолучателей КАК СТРОКА(10))) <> """"
	             |	И (ВЫРАЗИТЬ(ПисьмаНаОтправку.ТекстПисьма КАК СТРОКА(10))) <> """"
	             |	И ПисьмаНаОтправку.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)"; 
	
	//Тимофеев Ю.А. конец 03.08.2023

	
	Запрос.УстановитьПараметр("Дата1",Константы.ДатаЗапретаРедактирования.Получить()-30*24*3600);
	
	// Кухарь А.Ю.  05.06.2023 начало
	//
	если МассивДокументов.Количество()>0 тогда
		запрос.Текст=запрос.Текст+" и ПисьмаНаОтправку.Основание в (&МассивДокументов)";
		запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);
	КонецЕсли;
	// Кухарь А.Ю.  05.06.2023 конец
	
	
	Результат = Запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		
		Основание = Результат.Основание;
		ПолучателиТекст=СтрЗаменить(Результат.СписокПолучателей,"##",Символы.ПС);
		КоличествоПолучателей=СтрЧислоСтрок(ПолучателиТекст);
		если КоличествоПолучателей= 0 тогда
			ЗаписатьВЛог("Регламент","В письме на основании "+Основание+" пустой получатель","Ошибка");
			Продолжить;
		КонецЕсли;
		СписокПолучателей=новый СписокЗначений;
		
		Для сч=1 по КоличествоПолучателей цикл
			ТекПолучатель=СтрПолучитьСтроку(ПолучателиТекст,сч);
			если Найти(ТекПолучатель,"@")=0 тогда
				ЗаписатьВЛог("Регламент","В письме на основании "+Основание+" некорректный получатель "+ТекПолучатель,"Ошибка");
				Продолжить;
			КонецЕсли;
			если СписокПолучателей.НайтиПоЗначению(ТекПолучатель)=Неопределено тогда
				СписокПолучателей.Добавить(СокрЛП(ТекПолучатель));	
			КонецЕсли;
		КонецЦикла; 
		
		//Тимофеев Ю.А. начало 03.08.2023   
		
		
		КопииТекст=СтрЗаменить(Результат.СписокПолучателейКопии,"##",Символы.ПС);
		// Смирнов М.Ю. 25.07.2025 HELP-6126 начало	
		//КоличествоАдресКопии=СтрЧислоСтрок(КопииТекст);
		КоличествоАдресКопии = ?(КопииТекст = "", 0, СтрЧислоСтрок(КопииТекст));
		// Смирнов М.Ю. 25.07.2025 HELP-6126 конец
		
		СписокКопии=новый СписокЗначений;
		
		Для сч=1 по КоличествоАдресКопии цикл
			ТекАдрКопии=СтрПолучитьСтроку(КопииТекст,сч);
			если Найти(ТекАдрКопии,"@")=0 тогда
				ЗаписатьВЛог("Регламент","В письме на основании "+Основание+" некорректный получатель копии "+ТекПолучатель,"Ошибка");
				Продолжить;
			КонецЕсли;
			если СписокКопии.НайтиПоЗначению(ТекАдрКопии)=Неопределено тогда
				СписокКопии.Добавить(СокрЛП(ТекАдрКопии));	
			КонецЕсли;
		КонецЦикла;       		
		
		//Тимофеев Ю.А. конец 03.08.2023
		
		Если СокрЛП(Результат.ИмяФайлаВложения) <> "" Тогда
			Вложение = Результат.Вложение.Получить();
		Иначе
			Вложение = Неопределено;
		КонецЕсли;
		
		// Смирнов М.Ю. 25.07.2025 HELP-6126 начало
		Если СписокПолучателей.Количество()>0 тогда
			КоличествоПопыток = 0;
			ПисьмоОтправлено = Ложь;
			Пока КоличествоПопыток < 3 Цикл
				Попытка  
					
					//Тимофеев Ю.А. начало 03.08.2023
					// Шворобей ВЮ 23.09.2022 ++
					//	ОтправитьПисьмо(Результат.ТекстПисьма,СписокПолучателей,Результат.ТемаПисьма, Вложение, СокрЛП(Результат.ИмяФайлаВложения), СокрЛП(Результат.АдресОтправителя));
					// Шворобей ВЮ 23.09.2022 ++ 
					
					//доп.параметр СписокКопии
					
					ОтправитьПисьмо(Результат.ТекстПисьма,СписокПолучателей,Результат.ТемаПисьма, Вложение, СокрЛП(Результат.ИмяФайлаВложения), СокрЛП(Результат.АдресОтправителя),СписокКопии);
					КоличествоПопыток = 3;
					ПисьмоОтправлено = Истина;
					//Тимофеев Ю.А. конец 03.08.2023
				Исключение
					
					КоличествоПопыток = КоличествоПопыток + 1;
					// обрабатываем ошибку
					ОписаниеОшибки = ОписаниеОшибки();
					ТекстСообщенияПользователю = "Возникла ошибка при отправки письма (на основании %1, получатель %2). Информацияпо ошибке: %3";
					ТекстОшибки = СтрШаблон(ТекстСообщенияПользователю, Основание, ТекПолучатель, ОписаниеОшибки);
					ЗаписатьВЛог("Регламент", ТекстОшибки, "Ошибка"); 
					// Смирнов М.Ю. 25.07.2025 HELP-6126 конец
				КонецПопытки;
			КонецЦикла;
			
			Если Не ПисьмоОтправлено Тогда
				// отправляем письмо ответственному менеджеру о том, что письмо не отправлено контрагенту
				Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
					ТекстПисьмаОбошибке = "Письмо не отправлено получателю %1. 
						| Для повторной отправке зайдите в меню ""Операции"", выберите ""Обработки"", далее в списке обраоток выберите 
						| ""АвтоотправкаПечатныхФормКонтрагентам"". С помощью обработки отправьте письмо повторно";
					ТекстПисьмаОбОшибкеКОтправке = СтрШаблон(ТекстПисьмаОбошибке, ТекПолучатель);
					
					// получаем почту ответственного менеджера
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ФизическиеЛица.ЕМэйл КАК ЕМэйл
					|ИЗ
					|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
					|		ПО РасходнаяНакладная.Контрагент = Контрагенты.Ссылка
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
					|		ПО РасходнаяНакладная.Менеджер = ФизическиеЛица.Ссылка
					|ГДЕ
					|	РасходнаяНакладная.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", Основание);
					РезультатЗапроса = Запрос.Выполнить();
					Если Не РезультатЗапроса.Пустой() Тогда
						
						Выборка = РезультатЗапроса.Выбрать();
						Выборка.Следующий(); 
						
						Если ЗначениеЗаполнено(Выборка.ЕМэйл) Тогда
							
							СписокПолучателей = Новый СписокЗначений;
							СписокПолучателей.Добавить(Выборка.ЕМэйл);
							ТемаПисьмаОбОшибке = СтрШаблон("Письмо не отправлено контрагенту %1", ТекПолучатель); 
							
							ЗаписьВРег = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
							ЗаписьВРег.Основание = Основание;
							ЗаписьВРег.ДатаСозданияПисьма = ТекущаяДата();
							ЗаписьВРег.Период = ТекущаяДата();
							
							ЗаписьВРег.ТекстПисьма = ТекстПисьмаОбОшибкеКОтправке;
							ЗаписьВРег.ТемаПисьма = ТемаПисьмаОбОшибке;
							ЗаписьВРег.СписокПолучателей = СписокПолучателей;
							ЗаписьВРег.Записать(); 
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
				
			
			Попытка
				////Михайловский 20221109 вместо нз мз +++
				////вместо
				НаборЗаписей=РегистрыСведений.ПисьмаНаОтправку.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ДатаСозданияПисьма.использование=Истина;
				НаборЗаписей.Отбор.ДатаСозданияПисьма.значение=результат.ДатаСозданияПисьма;
				НаборЗаписей.Отбор.Основание.использование=Истина;
				НаборЗаписей.Отбор.Основание.значение=Основание;
				НаборЗаписей.Прочитать();
				для каждого запись из НаборЗаписей цикл
					запись.ДатаОтправки=ТекущаяДата();
				КонецЦикла;
				НаборЗаписей.Записать();	
				////это вместо
				//МенЗап=РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
				//МенЗап.ДатаСозданияПисьма=результат.ДатаСозданияПисьма;
				//МенЗап.Основание=Основание;
				////МенЗап.Прочитать();
				//МенЗап.ДатаОтправки=ТекущаяДата();
				//МенЗап.Записать();
				////Михайловский 20221109 вместо нз мз +++
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписатьВЛог("Регламент", ОписаниеОшибки, "Ошибка");	
			КонецПопытки;

		КонецЕсли;
		
	КонецЦикла;
	
	// Кухарь А.Ю.  05.06.2023 начало
	//
	 
	// Кухарь А.Ю.  05.06.2023 конец
	
	
КонецПроцедуры  

//Тимофеев Ю.А. начало 03.08.2023 

//Процедура ОтправитьПисьмо(Текст,СписокПолучателей,Тема = "", АдресВложения = Неопределено, ИмяФайла = "", АдресОтправителя = "") Экспорт


Процедура ОтправитьПисьмо(Текст,СписокПолучателей,Тема = "", АдресВложения = Неопределено, ИмяФайла = "", АдресОтправителя = "",СписокКопии="") Экспорт
//Тимофеев Ю.А. конец 03.08.2023
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
	//ПочтовыйПрофиль.Пароль             = "*$*$*$";        
	////Кухарь А.Ю.  20.09.2025 начало
	//ПочтовыйПрофиль.ПользовательSMTP	   = "*%*%*%";
	//ПочтовыйПрофиль.ПарольSMTP	 		   = "*$*$*$";
	////Кухарь А.Ю.  20.09.2025 конец
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	ПочтовыйПрофиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	Для каждого ТекПолучатель из СписокПолучателей цикл
		Сообщение.Получатели.Добавить(ТекПолучатель.значение);
	КонецЦикла;  
	
	//Тимофеев Ю.А. начало 03.08.2023
	Если СписокКопии<> "" Тогда
		//если заполнен значен , есть копии
		Для каждого ТекКопия из СписокКопии цикл
			Сообщение.Копии.Добавить(ТекКопия.значение);
		КонецЦикла;
	КонецЕсли;
    //Тимофеев Ю.А. конец 03.08.2023
	
	// Шворобей ВЮ 23.09.2022 ++
	Сообщение.Отправитель = ?(АдресОтправителя <> "", АдресОтправителя, "helpdesk@collant.ru");
	// Шворобей ВЮ 23.09.2022 ++ 
	//Валетов + 22,09,2025  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7145
	Если СокрЛП(АдресОтправителя) = "robot@collant.ru" Тогда 
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
		//ПочтовыйПрофиль.Пароль             = "*$*$*$"; 
		//ПочтовыйПрофиль.ПользовательSMTP	   = "*%*%*%";
		//ПочтовыйПрофиль.ПарольSMTP	 		   = "*$*$*$";
		ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Логин;
		ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Пароль;
		ПочтовыйПрофиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Логин;
		ПочтовыйПрофиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуRobot).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
	КонецЕсли;
	//Валетов -
	
	Сообщение.Тема = Тема;
	
	//Кухарь 15.01.19 начало
	ХТМЛ=Сообщение.Тексты.Добавить(Текст);
	ХТМЛ.ТипТекста=ТипТекстаПочтовогоСообщения.HTML;
	//Кухарь 15.01.19 конец
	
	Если АдресВложения <> Неопределено И ИмяФайла <> "" Тогда
		//Михайловский 20221109 доп. контроль влож. +++
		//вместо
		//Сообщение.Вложения.Добавить(АдресВложения, ИмяФайла);
		//это
		Если ТипЗнч(АдресВложения)=Тип("ХранилищеЗначения") Тогда
			Сообщение.Вложения.Добавить(АдресВложения.Получить(), ИмяФайла);
		Иначе
			Сообщение.Вложения.Добавить(АдресВложения, ИмяФайла);
		КонецЕсли;
		//Михайловский 20221109 доп. контроль влож. ---
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль);
		Почта.Послать(Сообщение);
		Почта.Отключиться();
	Исключение
		// Смирнов М.Ю. 25.07.2025 HELP-6126 начало
		//Сообщить(ОписаниеОшибки()); 
		//Возврат;
		ОписаниеОшибки = ОписаниеОшибки();
		ВызватьИсключение СтрШаблон("Не уладось отправить письмо. Причина ошибки: %1", ОписаниеОшибки);
		// Смирнов М.Ю. 25.07.2025 HELP-6126 конец
	КонецПопытки; 
	
КонецПроцедуры
